spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
#include <stdint.h>
#include <cstring>
#include <cmath>

#include "bsp.hpp"
#include "error.hpp"
#include "debug.hpp"
#include "gpio.hpp"
#include "scheduler.hpp"
#include "timer.hpp"
#include "binascii.hpp"
#include "smd_sat.hpp"
#include "pmu.hpp"

#include "nrf_delay.h"
#include "nrf_gpio.h"

extern Scheduler *system_scheduler;
extern Timer *system_timer;

static constexpr const char *const spistatus_string[] =
{
    "SPI_UNKNOWN",
    "SPI_INIT",
    "SPI_IDLE",
    "SPI_PROCESS_CMD",
    "SPI_WAITING_RX",
    "SPI_WAITING_TX",
    "SPI_WAITING_MAC_EVT",
    "SPI_ERROR"
};
static constexpr const char *const kmacstatus_string[] =
{
    "MAC_UNKNOWN",
    "MAC_OK",
    "MAC_TX_DONE",
    "MAC_TX_SIZE_ERROR",
    "MAC_TXACK_DONE",
    "MAC_TX_TIMEOUT",
    "MAC_TXACK_TIMEOUT",
    "MAC_RX_ERROR",
    "MAC_RX_TIMEOUT",
    "MAC_ERROR"
};

void SmdSat::read_byte(uint8_t *byte_read) {
    nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
    uint8_t read_cmd = SMDSAT_CMD_NONE;
    int ret;

    ret = m_nrf_spim->transfer(&read_cmd, byte_read, sizeof(read_cmd));
    if (ret) {
       throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::send_command(uint8_t command) {
    uint8_t buffer_read;
    int ret;
	DEBUG_TRACE("%s::Send %u",__func__, command);

    ret = m_nrf_spim->transfer(&command, &buffer_read, sizeof(command));
    if (ret) {
       throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::send_command(const uint8_t *tx_data, uint8_t *rx_data, uint16_t size) {
    int ret = m_nrf_spim->transfer(tx_data, rx_data, size);
    if (ret) {
       throw ErrorCode::SPI_COMMS_ERROR;
	}
}

// ============================================================================
// Protocol A+ Implementation (Based on Zephyr argos-smd-driver)
// ============================================================================
// Key features:
// - Fixed 64-byte frames with 0xFF padding
// - CRC-8 over MAGIC + SEQ + CMD + LEN + DATA (includes MAGIC!)
// - Pipelined protocol: response to command N arrives in transaction N+2
// - BUSY pattern (0xBB) handling for flash operations
// ============================================================================

uint16_t SmdSat::build_aplus_frame(uint8_t *frame, uint8_t cmd, const uint8_t *data, uint16_t data_len) {
    // Validate data length
    if (data_len > SPI_PROTOCOL_APLUS_MAX_DATA_LEN) {
        DEBUG_ERROR("SmdSat::%s: Data too long (%u > %u)", __func__, data_len, SPI_PROTOCOL_APLUS_MAX_DATA_LEN);
        return 0;
    }

    // Initialize frame with padding
    memset(frame, SPI_PROTOCOL_APLUS_PAD_BYTE, SPI_PROTOCOL_APLUS_FRAME_SIZE);

    uint16_t idx = 0;

    // Build frame: [MAGIC][SEQ][CMD][LEN][DATA][CRC8][PADDING...]
    frame[idx++] = SPI_PROTOCOL_APLUS_MAGIC_REQUEST;
    frame[idx++] = m_sequence_number;
    frame[idx++] = cmd;
    frame[idx++] = static_cast<uint8_t>(data_len);

    // Copy data if any
    if (data != nullptr && data_len > 0) {
        memcpy(&frame[idx], data, data_len);
        idx += data_len;
    }

    // Calculate CRC-8 over MAGIC + SEQ + CMD + LEN + DATA (includes MAGIC!)
    uint8_t crc = spi_crc8_ccitt(frame, idx);
    frame[idx++] = crc;

    DEBUG_TRACE("SmdSat::%s: Frame built - SEQ=%u, CMD=0x%02X, LEN=%u, CRC=0x%02X",
                __func__, m_sequence_number, cmd, data_len, crc);

    // Return fixed frame size for SPI transfer
    return SPI_PROTOCOL_APLUS_FRAME_SIZE;
}

bool SmdSat::parse_aplus_response(const uint8_t *rx_buffer, uint16_t rx_len, SpiAplusResponse *response) {
    if (response == nullptr || rx_buffer == nullptr) {
        return false;
    }

    response->valid = false;
    response->data_len = 0;

    // Scan for response magic byte, skipping IDLE (0xAA) and padding (0xFF)
    // (matches Zephyr parse_response_frame behavior)
    uint16_t offset = 0;
    while (offset < rx_len) {
        if (rx_buffer[offset] == SPI_PROTOCOL_APLUS_MAGIC_RESPONSE) {
            break;
        }
        if (rx_buffer[offset] == SPI_PROTOCOL_APLUS_BUSY_PATTERN) {
            DEBUG_TRACE("SmdSat::%s: BUSY pattern at offset %u", __func__, offset);
            response->status = SPI_APLUS_STATUS_BUSY;
            return false;
        }
        if (rx_buffer[offset] != SPI_PROTOCOL_APLUS_IDLE_PATTERN &&
            rx_buffer[offset] != SPI_PROTOCOL_APLUS_PAD_BYTE) {
            break;
        }
        offset++;
    }

    if (offset >= rx_len || rx_buffer[offset] != SPI_PROTOCOL_APLUS_MAGIC_RESPONSE) {
        if (rx_buffer[0] == SPI_PROTOCOL_APLUS_IDLE_PATTERN) {
            DEBUG_TRACE("SmdSat::%s: IDLE pattern - no response ready", __func__);
            response->status = SPI_APLUS_STATUS_NOT_READY;
        } else {
            DEBUG_WARN("SmdSat::%s: No response magic found (first byte: 0x%02X)", __func__, rx_buffer[0]);
            response->status = SPI_APLUS_STATUS_FRAME_ERROR;
        }
        return false;
    }

    // Minimum frame: MAGIC + SEQ + STATUS + LEN + CRC = 5 bytes
    if (rx_len - offset < SPI_PROTOCOL_APLUS_HEADER_LEN + SPI_PROTOCOL_APLUS_CRC_LEN) {
        DEBUG_WARN("SmdSat::%s: Response too short after offset %u", __func__, offset);
        return false;
    }

    // Parse header at offset
    response->seq = rx_buffer[offset + 1];
    response->status = static_cast<SpiAplusStatus>(rx_buffer[offset + 2]);
    uint8_t data_len = rx_buffer[offset + 3];

    if (data_len > SPI_PROTOCOL_APLUS_MAX_DATA_LEN) {
        DEBUG_WARN("SmdSat::%s: Invalid data length %u", __func__, data_len);
        response->status = SPI_APLUS_STATUS_SIZE_ERROR;
        return false;
    }

    // Bounds check: header + data + CRC must fit in remaining buffer
    uint16_t expected_len = SPI_PROTOCOL_APLUS_HEADER_LEN + data_len + SPI_PROTOCOL_APLUS_CRC_LEN;
    if (rx_len - offset < expected_len) {
        DEBUG_WARN("SmdSat::%s: Response incomplete: got %u, expected %u",
                   __func__, rx_len - offset, expected_len);
        response->status = SPI_APLUS_STATUS_FRAME_ERROR;
        return false;
    }

    // Copy data
    response->data_len = data_len;
    if (data_len > 0) {
        memcpy(response->data, &rx_buffer[offset + 4], data_len);
    }

