spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
    // Validate CRC-8 over MAGIC + SEQ + STATUS + LEN + DATA
    uint16_t crc_data_len = SPI_PROTOCOL_APLUS_HEADER_LEN + data_len;
    uint8_t received_crc = rx_buffer[offset + crc_data_len];
    uint8_t calculated_crc = spi_crc8_ccitt(&rx_buffer[offset], crc_data_len);

    if (received_crc != calculated_crc) {
        DEBUG_WARN("SmdSat::%s: CRC mismatch (recv=0x%02X, calc=0x%02X)",
                   __func__, received_crc, calculated_crc);
        response->status = SPI_APLUS_STATUS_FRAME_CRC_ERROR;
        return false;
    }

    response->valid = true;
    DEBUG_TRACE("SmdSat::%s: Response parsed - SEQ=%u, STATUS=%u, LEN=%u",
                __func__, response->seq, static_cast<int>(response->status), response->data_len);

    return true;
}

// Command-specific delay (matches Zephyr timing constants)
static uint32_t get_command_delay(uint8_t cmd) {
    switch (cmd) {
        case SMDSAT_CMD_DFU_ERASE:
            return SMDSAT_TIMING_ERASE_MS;
        case SMDSAT_CMD_DFU_WRITE_DATA:
        case SMDSAT_CMD_DFU_SET_HEADER:
        case SMDSAT_CMD_WRITE_RCONF:
        case SMDSAT_CMD_WRITE_KMAC:
        case SMDSAT_CMD_WRITE_SECKEY:
        case SMDSAT_CMD_SAVE_RCONF:
        case SMDSAT_CMD_WRITE_ID:
        case SMDSAT_CMD_WRITE_ADDR:
        case SMDSAT_CMD_WRITE_LPM:
        case SMDSAT_CMD_WRITE_TCXO:
        case SMDSAT_CMD_WRITE_CW:
        case SMDSAT_CMD_WRITE_PREPASSEN:
        case SMDSAT_CMD_WRITE_UDATE:
            return SMDSAT_TIMING_WRITE_MS;
        case SMDSAT_CMD_DFU_RESET:
        case SMDSAT_CMD_DFU_JUMP:
            return SMDSAT_TIMING_RESET_MS;
        default:
            return SMDSAT_TIMING_STANDARD_MS;
    }
}

// Check if RX buffer is all IDLE or all BUSY (slave not ready)
static bool is_slave_not_ready(const uint8_t *buf, uint8_t check_len) {
    bool all_idle = true, all_busy = true;
    for (uint8_t i = 0; i < check_len; i++) {
        if (buf[i] != SPI_PROTOCOL_APLUS_IDLE_PATTERN) all_idle = false;
        if (buf[i] != SPI_PROTOCOL_APLUS_BUSY_PATTERN) all_busy = false;
    }
    return all_idle || all_busy;
}

bool SmdSat::send_command_aplus(uint8_t command, const uint8_t *tx_data, uint16_t tx_len,
                                SpiAplusResponse *response) {
    // Inter-transaction delay: wait for STM32 DMA re-arm from previous transaction
    nrf_delay_ms(SMDSAT_SPI_INTER_TX_DELAY_MS);

    // Build the A+ CMD frame (fixed 64 bytes)
    uint8_t tx_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];
    uint8_t rx_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];

    uint16_t frame_len = build_aplus_frame(tx_frame, command, tx_data, tx_len);
    if (frame_len == 0) {
        DEBUG_ERROR("SmdSat::%s: Failed to build frame", __func__);
        return false;
    }

    memset(rx_frame, 0, sizeof(rx_frame));

    // Transaction 1: Send command (response will be in transaction 2)
    int ret = m_nrf_spim->transfer(tx_frame, rx_frame, SPI_PROTOCOL_APLUS_FRAME_SIZE);
    if (ret) {
        DEBUG_ERROR("SmdSat::%s: SPI transfer failed", __func__);
        throw ErrorCode::SPI_COMMS_ERROR;
    }

    // Wait for STM32 to process command (command-specific delay)
    uint32_t cmd_delay = get_command_delay(command);
    nrf_delay_ms(cmd_delay);

    // Transaction 2+: Send NOP to retrieve response (pipelined protocol)
    m_sequence_number++;

    uint8_t nop_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];
    uint8_t response_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];

    bool is_flash_op = (cmd_delay >= SMDSAT_TIMING_WRITE_MS);
    uint8_t max_retries = is_flash_op ? SMDSAT_SPI_BUSY_MAX_RETRIES : 3;

    for (uint8_t retry = 0; retry <= max_retries; retry++) {
        build_aplus_frame(nop_frame, SMDSAT_CMD_NONE, nullptr, 0);
        memset(response_frame, 0, sizeof(response_frame));

        ret = m_nrf_spim->transfer(nop_frame, response_frame, SPI_PROTOCOL_APLUS_FRAME_SIZE);
        if (ret) {
            DEBUG_ERROR("SmdSat::%s: Failed to read response", __func__);
            throw ErrorCode::SPI_COMMS_ERROR;
        }

        // Check for BUSY or IDLE or all-zero pattern (slave not ready) — check 8 bytes like Zephyr
        if (is_slave_not_ready(response_frame, 8) && retry < max_retries) {
            DEBUG_TRACE("SmdSat::%s: Slave not ready (0x%02X), retry %u/%u",
                        __func__, response_frame[0], retry + 1, max_retries);
            nrf_delay_ms(SMDSAT_SPI_BUSY_RETRY_DELAY_MS);
            m_sequence_number++;
            continue;
        }
        break;
    }

    // Increment sequence number for next transaction (matches Zephyr seq_num++ at end)
    m_sequence_number++;

    // Parse response if caller wants it
    if (response != nullptr) {
        bool parsed = parse_aplus_response(response_frame, SPI_PROTOCOL_APLUS_FRAME_SIZE, response);
        if (!parsed && !SPI_APLUS_IS_RECOVERABLE(response->status)) {
            return false;
        }
    }

    return true;
}

bool SmdSat::send_command_auto(uint8_t command, const uint8_t *tx_data, uint16_t tx_len,
                               uint8_t *rx_data, uint16_t *rx_len) {
    // Protocol A+ only (no legacy fallback)
    SpiAplusResponse response;

    for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
        if (send_command_aplus(command, tx_data, tx_len, &response)) {
            // Copy response data if requested
            if (rx_data != nullptr && rx_len != nullptr && *rx_len > 0 && response.data_len > 0) {
                uint16_t copy_len = (response.data_len < *rx_len) ? response.data_len : *rx_len;
                memcpy(rx_data, response.data, copy_len);
                *rx_len = copy_len;
            } else if (rx_len != nullptr) {
                *rx_len = response.data_len;
            }

            if (response.status == SPI_APLUS_STATUS_OK) {
                return true;
            }

            if (!SPI_APLUS_IS_RECOVERABLE(response.status)) {
                DEBUG_WARN("SmdSat::%s: Non-recoverable error %u for cmd 0x%02X",
                           __func__, static_cast<int>(response.status), command);
                return false;
            }
        }

        DEBUG_TRACE("SmdSat::%s: Retry %u/%u for cmd 0x%02X",
                    __func__, retry + 1, SMDSAT_SPI_MAX_RETRIES, command);
        nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
    }

