spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
    return false;
}

// 2-phase write helper (matches Zephyr argos_spi_write_2phase)
// Phase 1: Send REQ command to prepare STM32 for data reception
// Phase 2: Send WRITE command with actual data
bool SmdSat::send_command_2phase(uint8_t req_cmd, uint8_t write_cmd,
                                  const uint8_t *data, uint16_t len) {
    DEBUG_TRACE("SmdSat::%s: REQ=0x%02X, WRITE=0x%02X, len=%u", __func__, req_cmd, write_cmd, len);

    // Phase 1: Send REQ command
    if (!send_command_auto(req_cmd)) {
        DEBUG_ERROR("SmdSat::%s: REQ 0x%02X failed", __func__, req_cmd);
        return false;
    }

    // Small delay for STM32 to prepare RX buffer
    nrf_delay_ms(1);

    // Phase 2: Send WRITE command with data
    if (!send_command_auto(write_cmd, data, len)) {
        DEBUG_ERROR("SmdSat::%s: WRITE 0x%02X failed", __func__, write_cmd);
        return false;
    }

    return true;
}

void SmdSat::load_kmac_profil(uint8_t profile)
{
	DEBUG_TRACE("SmdSat::%s: Load KMAC profile %u", __func__, profile);
	if (!send_command_2phase(SMDSAT_CMD_WRITE_KMAC_REQ, SMDSAT_CMD_WRITE_KMAC, &profile, 1)) {
		DEBUG_ERROR("SmdSat::%s: Failed to load KMAC profile", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::read_kmac(uint8_t *profile) {
	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_KMAC, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read KMAC profile", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	*profile = rx[0];
	DEBUG_TRACE("SmdSat::%s: KMAC profile=%u", __func__, *profile);
}

void SmdSat::read_rconf_raw(uint8_t *rconf_raw, uint16_t *len) {
	uint16_t rx_len = SMDSAT_CMD_READ_RCONF_RAW_LEN;
	if (!send_command_auto(SMDSAT_CMD_READ_RCONF_RAW, nullptr, 0, rconf_raw, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read raw radio config", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	if (len) *len = rx_len;
	DEBUG_TRACE("SmdSat::%s: RCONF_RAW len=%u", __func__, rx_len);
}

void SmdSat::read_spimac_state(uint8_t *spi_state, uint8_t *mac_state) {
	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_SPIMAC_STATE, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read SPI MAC state", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	if (spi_state) *spi_state = rx[0];
	if (mac_state) *mac_state = rx[1];
	DEBUG_TRACE("SmdSat::%s: SPI state=%u, MAC state=%u", __func__, rx[0], rx[1]);
}

void SmdSat::read_firmware_info(uint8_t *info, uint16_t *len) {
	uint16_t rx_len = SMDSAT_CMD_READ_FIRMWARE_LEN;
	if (!send_command_auto(SMDSAT_CMD_READ_FIRMWARE, nullptr, 0, info, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read firmware info", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	if (len) *len = rx_len;
	DEBUG_TRACE("SmdSat::%s: firmware info len=%u", __func__, rx_len);
}

// CW (Continuous Wave) commands
void SmdSat::read_cw(uint8_t *cw_data, uint16_t *len) {
	uint16_t rx_len = (len && *len > 0) ? *len : 32;
	if (!send_command_auto(SMDSAT_CMD_READ_CW, nullptr, 0, cw_data, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read CW", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	if (len) *len = rx_len;
	DEBUG_TRACE("SmdSat::%s: CW data len=%u", __func__, rx_len);
}

void SmdSat::write_cw(const uint8_t *cw_data, uint16_t len) {
	DEBUG_TRACE("SmdSat::%s: len=%u", __func__, len);
	if (!send_command_2phase(SMDSAT_CMD_WRITE_CW_REQ, SMDSAT_CMD_WRITE_CW, cw_data, len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to write CW", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

// Prepass commands
void SmdSat::read_prepassen(uint8_t *prepass_data, uint16_t *len) {
	uint16_t rx_len = (len && *len > 0) ? *len : 32;
	if (!send_command_auto(SMDSAT_CMD_READ_PREPASSEN, nullptr, 0, prepass_data, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read prepass", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	if (len) *len = rx_len;
	DEBUG_TRACE("SmdSat::%s: prepass data len=%u", __func__, rx_len);
}

void SmdSat::write_prepassen(const uint8_t *prepass_data, uint16_t len) {
	DEBUG_TRACE("SmdSat::%s: len=%u", __func__, len);
	if (!send_command_2phase(SMDSAT_CMD_WRITE_PREPASSEN_REQ, SMDSAT_CMD_WRITE_PREPASSEN, prepass_data, len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to write prepass", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

// UTC date commands
void SmdSat::read_udate(uint8_t *udate_data, uint16_t *len) {
	uint16_t rx_len = (len && *len > 0) ? *len : 32;
	if (!send_command_auto(SMDSAT_CMD_READ_UDATE, nullptr, 0, udate_data, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read UTC date", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	if (len) *len = rx_len;
	DEBUG_TRACE("SmdSat::%s: udate data len=%u", __func__, rx_len);
}

void SmdSat::write_udate(const uint8_t *udate_data, uint16_t len) {
	DEBUG_TRACE("SmdSat::%s: len=%u", __func__, len);
	if (!send_command_2phase(SMDSAT_CMD_WRITE_UDATE_REQ, SMDSAT_CMD_WRITE_UDATE, udate_data, len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to write UTC date", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

// SPI protocol synchronization (matches Zephyr argos_spi_sync)
void SmdSat::spi_sync() {
	DEBUG_INFO("SmdSat::%s: Synchronizing SPI protocol...", __func__);

	m_sequence_number = 0;

	uint8_t tx_buf[SPI_PROTOCOL_APLUS_FRAME_SIZE];
	uint8_t rx_buf[SPI_PROTOCOL_APLUS_FRAME_SIZE];
	int sync_count = 0;

	for (int i = 0; i < 5; i++) {
		memset(tx_buf, 0xFF, sizeof(tx_buf));
		memset(rx_buf, 0, sizeof(rx_buf));

		int ret = m_nrf_spim->transfer(tx_buf, rx_buf, SPI_PROTOCOL_APLUS_FRAME_SIZE);
		if (ret) {
			DEBUG_WARN("SmdSat::%s: Sync transaction %d failed: %d", __func__, i, ret);
			continue;
		}

		// Check if we're getting consistent idle pattern (0xAA)
		bool all_idle = true;
		for (int j = 0; j < 8; j++) {
			if (rx_buf[j] != SPI_PROTOCOL_APLUS_IDLE_PATTERN) {
				all_idle = false;
				break;
			}
		}

		if (all_idle) {
			sync_count++;
			if (sync_count >= 2) {
				DEBUG_INFO("SmdSat::%s: SPI synchronized after %d transactions", __func__, i + 1);
				return;
			}
		} else {
			sync_count = 0;
		}

