spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
		nrf_delay_ms(SMDSAT_SPI_DETECT_TIMEOUT_MS);
	}

	DEBUG_WARN("SmdSat::%s: SPI sync incomplete, proceeding anyway", __func__);
}

void SmdSat::get_spi_status(uint8_t *status) {
	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_SPI_STATUS, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read SPI status", __func__);
		*status = SMDSAT_SPICMD_ERROR;
		return;
	}
	*status = rx[0];
	DEBUG_TRACE("SmdSat::%s: status=%u", __func__, *status);
}

void SmdSat::get_kmac_status(uint8_t *status) {
	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_MAC_STATUS, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read KMAC status", __func__);
		*status = MAC_ERROR;
		return;
	}
	*status = rx[0];
	DEBUG_TRACE("SmdSat::%s: status=%u", __func__, *status);
}

void SmdSat::set_radio_conf(smd_uint8_array_t *radio_conf) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	if (radio_conf->size != SMDSAT_CMD_WRITECONF_LEN - 1) {
		DEBUG_ERROR("SmdSat::%s: Size mismatch %u != %u",
			__func__, radio_conf->size, SMDSAT_CMD_WRITECONF_LEN - 1);
		return;
	}
	if (!send_command_2phase(SMDSAT_CMD_WRITE_RCONF_REQ, SMDSAT_CMD_WRITE_RCONF,
	                         radio_conf->p_data, radio_conf->size)) {
		DEBUG_ERROR("SmdSat::%s: Failed to set radio conf", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::read_radio_conf(SmdArgosModulation *modulation) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	uint8_t rx[SMDSAT_CMD_READCONF_LEN] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_RCONF, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read radio conf", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}

	uint32_t min_frequency = (rx[3] << 24) | (rx[2] << 16) | (rx[1] << 8) | rx[0];
	uint32_t max_frequency = (rx[7] << 24) | (rx[6] << 16) | (rx[5] << 8) | rx[4];
	int8_t rf_level = rx[8];
	*modulation = static_cast<SmdArgosModulation>(rx[9]);

	DEBUG_INFO("SmdSat::%s: Modulation: %u, Min Freq: %u, Max Freq: %u, RF Level %d", __func__,
		*modulation, min_frequency, max_frequency, rf_level);
}

bool SmdSat::save_radio_conf() {
	DEBUG_TRACE("SmdSat::%s", __func__);
	if (!send_command_auto(SMDSAT_CMD_SAVE_RCONF)) {
		DEBUG_WARN("SmdSat::%s: Radio conf failed to save", __func__);
		return false;
	}
	DEBUG_INFO("SmdSat::%s: Radio conf saved", __func__);
	return true;
}

void SmdSat::read_lpm(uint8_t *lpm_mode) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_LPM, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read LPM", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	*lpm_mode = rx[0];
	DEBUG_INFO("SmdSat::SMD LPM mode is: %u", *lpm_mode);
}

void SmdSat::write_lpm(uint8_t *lpm_mode) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	if (!send_command_2phase(SMDSAT_CMD_WRITE_LPM_REQ, SMDSAT_CMD_WRITE_LPM, lpm_mode, 1)) {
		DEBUG_ERROR("SmdSat::%s: Failed to write LPM", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::read_version(uint8_t *version) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_VERSION, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read version", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	*version = rx[0];
	DEBUG_INFO("SmdSat::SMD SPI Version: %u", *version);
}

void SmdSat::read_address(smd_uint8_array_t *address) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	if (address->size != SMDSAT_CMD_READ_ADDR_LEN) {
		DEBUG_ERROR("SmdSat::%s: Size mismatch %u != %u",
			__func__, address->size, SMDSAT_CMD_READ_ADDR_LEN);
		return;
	}
	uint16_t rx_len = address->size;
	if (!send_command_auto(SMDSAT_CMD_READ_ADDR, nullptr, 0, address->p_data, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read address", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::set_address(smd_uint8_array_t *address) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	if (address->size != SMDSAT_CMD_WRITE_ADDR_LEN - 1) {
		DEBUG_ERROR("SmdSat::%s: Size mismatch %u != %u",
			__func__, address->size, SMDSAT_CMD_WRITE_ADDR_LEN - 1);
		return;
	}
	if (!send_command_2phase(SMDSAT_CMD_WRITE_ADDR_REQ, SMDSAT_CMD_WRITE_ADDR,
	                         address->p_data, address->size)) {
		DEBUG_ERROR("SmdSat::%s: Failed to set address", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::read_seckey(smd_uint8_array_t *seckey) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	if (seckey->size != SMDSAT_CMD_READ_SECKEY_LEN) {
		DEBUG_ERROR("SmdSat::%s: Size mismatch %u != %u",
			__func__, seckey->size, SMDSAT_CMD_READ_SECKEY_LEN);
		return;
	}
	uint16_t rx_len = seckey->size;
	if (!send_command_auto(SMDSAT_CMD_READ_SECKEY, nullptr, 0, seckey->p_data, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read seckey", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::set_seckey(smd_uint8_array_t *seckey) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	if (seckey->size != SMDSAT_CMD_WRITE_SECKEY_LEN - 1) {
		DEBUG_ERROR("SmdSat::%s: Size mismatch %u != %u",
			__func__, seckey->size, SMDSAT_CMD_WRITE_SECKEY_LEN);
		return;
	}
	if (!send_command_2phase(SMDSAT_CMD_WRITE_SECKEY_REQ, SMDSAT_CMD_WRITE_SECKEY,
	                         seckey->p_data, seckey->size)) {
		DEBUG_ERROR("SmdSat::%s: Failed to set seckey", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::read_id(uint32_t *id) {
	if (id == nullptr) {
		DEBUG_ERROR("SmdSat::%s: id ptr is null", __func__);
		return;
	}
	uint8_t rx[SMDSAT_CMD_READ_ID_LEN] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_ID, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read ID", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	*id = 0;
	for (int i = 0; i < SMDSAT_CMD_READ_ID_LEN; i++) {
		*id |= rx[i] << (8 * i);
	}
	DEBUG_INFO("SmdSat::%s: SMD ID: %u", __func__, *id);
}

void SmdSat::set_id(uint32_t id) {
	DEBUG_TRACE("SmdSat::%s: id: %u", __func__, id);
	uint8_t data[4];
	memcpy(data, &id, sizeof(id));
	if (!send_command_2phase(SMDSAT_CMD_WRITE_ID_REQ, SMDSAT_CMD_WRITE_ID, data, sizeof(data))) {
		DEBUG_ERROR("SmdSat::%s: Failed to set ID", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::read_tcxo_warmup(uint8_t *time_ms) {
	if (time_ms == nullptr) {
		DEBUG_ERROR("SmdSat::%s: tcxo ptr is null", __func__);
		return;
	}
	uint8_t rx[SMDSAT_CMD_READ_ID_LEN] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_TCXO, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read TCXO warmup", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	*time_ms = 0;
	for (int i = 0; i < SMDSAT_CMD_READ_ID_LEN; i++) {
		*time_ms |= rx[i] << (8 * i);
	}
	DEBUG_INFO("SmdSat::%s: SMD TCXO warmup time: %u", __func__, *time_ms);
}

void SmdSat::write_tcxo_warmup(uint32_t time_ms) {
	DEBUG_TRACE("SmdSat::%s: tcxo warmup time: %u", __func__, time_ms);
	uint8_t data[4];
	memcpy(data, &time_ms, sizeof(time_ms));
	if (!send_command_2phase(SMDSAT_CMD_WRITE_TCXO_REQ, SMDSAT_CMD_WRITE_TCXO, data, sizeof(data))) {
		DEBUG_ERROR("SmdSat::%s: Failed to write TCXO warmup", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSat::read_serial(smd_uint8_array_t *serial) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	if (serial->size != SMDSAT_CMD_READ_SERIAL_LEN) {
		DEBUG_ERROR("SmdSat::%s: Size mismatch %u != %u",
			__func__, serial->size, SMDSAT_CMD_READ_SERIAL_LEN);
		return;
	}
	uint16_t rx_len = serial->size;
	if (!send_command_auto(SMDSAT_CMD_READ_SN, nullptr, 0, serial->p_data, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: Failed to read serial", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

