spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::set_tcxo_warmup_internal(uint32_t time_s)
{
	DEBUG_TRACE("SmdSat::%s", __func__);
	this->write_tcxo_warmup(time_s * 1000);
}

void SmdSat::set_tcxo_control(bool state) {
	(void)state;
	DEBUG_TRACE("SmdSat::%s: Managed by SMD module", __func__);
}

void SmdSat::print_firmware_version() {
	// CMD_READ_VERSION (0x05) via A+ - returns firmware version string
	// (CMD_READ_FIRMWARE 0x06 is NOT supported in A+ by STM32 firmware)
	uint8_t rx[SPI_PROTOCOL_APLUS_MAX_DATA_LEN] = {0};
	uint16_t rx_len = sizeof(rx);

	if (!send_command_auto(SMDSAT_CMD_READ_VERSION, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSat::%s: CMD_READ_VERSION failed", __func__);
		return;
	}

	size_t len = 0;
	while (len < rx_len && rx[len] != 0 &&
	       rx[len] >= 0x20 && rx[len] < 0x7F) {
		len++;
	}

	if (len > 0) {
		DEBUG_INFO("SmdSat::%s: Firmware=%.*s", __func__, (int)len, (char*)rx);
	} else {
		DEBUG_WARN("SmdSat::%s: Empty firmware version (rx_len=%u)", __func__, rx_len);
	}
}

bool SmdSat::smd_ping()
{
	DEBUG_TRACE("SmdSat::%s", __func__);

	for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
		try {
			if (send_command_auto(SMDSAT_CMD_PING)) {
				DEBUG_INFO("SmdSat::%s: ACK from SMD received", __func__);
				return true;
			}
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: Ping failed, retry %u/%u", __func__, retry + 1, SMDSAT_SPI_MAX_RETRIES);
		}
		nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
	}

	DEBUG_WARN("SmdSat::%s: Ping not received after %u retries", __func__, SMDSAT_SPI_MAX_RETRIES);
	return false;
}

bool SmdSat::is_tx_finished() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);

	if (!send_command_auto(SMDSAT_CMD_READ_SPIMAC_STATE, nullptr, 0, rx, &rx_len)) {
		DEBUG_WARN("SmdSat::%s: Failed to read SPIMAC state", __func__);
		return false;
	}

	uint8_t spi_state = rx[0];
	uint8_t mac_status = rx[1];

	DEBUG_TRACE("SmdSat::%s: spiState=%02X macStatus=%02X", __func__, spi_state, mac_status);

	if (mac_status == MAC_TX_DONE) {
		DEBUG_INFO("SmdSat::%s: TX completed successfully", __func__);
		return true;
	}

	if (mac_status == MAC_TX_TIMEOUT) {
		DEBUG_WARN("SmdSat::%s: TX timeout (no satellite)", __func__);
		return true;
	}

	if (mac_status == MAC_ERROR) {
		DEBUG_ERROR("SmdSat::%s: TX error", __func__);
		return true;
	}

	return false;
}

bool SmdSat::is_tx_in_progress() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);

	if (!send_command_auto(SMDSAT_CMD_READ_SPIMAC_STATE, nullptr, 0, rx, &rx_len)) {
		DEBUG_WARN("SmdSat::%s: Failed to read SPIMAC state", __func__);
		return false;
	}

	return (rx[1] == MAC_TX_IN_PROGRESS);
}

bool SmdSat::is_command_accepted() {
	return true;
}

bool SmdSat::is_firmware_ready() {
	return true;
}

void SmdSat::power_off() {
	DEBUG_TRACE("SmdSat::%s",__func__);
    if (!SMD_STATE_EQUAL(stopped)) {
    	m_stopping = true;
    }
}

void SmdSat::power_on() {
	DEBUG_TRACE("SmdSat::%s",__func__);

    if (m_state != SmdSat::stopped) {
    	m_stopping = false;
    	DEBUG_TRACE("SmdSat::%s: not disabled: state=%u", __func__, (unsigned int)m_state);
    	return;
    }

    m_state = SmdSatState::starting;
    m_stopping = false;

    DEBUG_TRACE("SmdSat::%s:: start state machine",__func__);
    state_machine();
}

void SmdSat::power_off_immediate()
{
	DEBUG_TRACE("SmdSat::%s",__func__);

    if (!SMD_STATE_EQUAL(stopped)) {
    	system_scheduler->cancel_task(m_task);
    	SMD_STATE_CHANGE(idle, stopped);
    }
}

SmdSat::SmdSat(unsigned int idle_shutdown_ms) {
	DEBUG_TRACE("SmdSat::%s",__func__);
	set_idle_timeout(idle_shutdown_ms);
    m_packet_buffer.clear();
	m_modulation = ARGOS_MOD_LDA2;
    m_nrf_spim = nullptr;
    m_state = SmdSatState::stopped;
    m_tcxo_warmup_time = DEFAULT_TCXO_WARMUP_TIME_SECONDS;
    m_tx_power = 0;
	// Protocol A+ initialization (forced, no legacy)
	m_protocol_mode = SpiProtocolMode::APLUS;
	m_sequence_number = 0;
	m_protocol_detected = true;
	// DFU initialization
	m_dfu_mode = false;
	memset(&m_dfu_info, 0, sizeof(m_dfu_info));
	this->shutdown();
	is_kmac_profil_loaded = false;
}

SmdSat::~SmdSat() {
	power_off_immediate();
}

void SmdSat::shutdown(void) {
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);
	nrf_delay_ms(SMDSAT_DELAY_RST_MS);
	GPIOPins::clear(SAT_PWR_EN);
	nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);  // Disconnect reset (ext pull-up)
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
#endif
}

void SmdSat::state_machine(bool use_scheduler) {
	m_next_delay = 0;

	switch (m_state) {
	case SmdSat::starting:
		SMD_STATE_CALL(starting);
		break;
	case SmdSat::powering_on:
		SMD_STATE_CALL(powering_on);
		break;
	case SmdSat::load_kmac:
		SMD_STATE_CALL(load_kmac);
		break;
	case SmdSat::idle_pending:
		SMD_STATE_CALL(idle_pending);
		break;
	case SmdSat::idle:
		SMD_STATE_CALL(idle);
		break;
	case SmdSat::transmit_pending:
		SMD_STATE_CALL(transmit_pending);
		break;
	case SmdSat::transmitting:
		SMD_STATE_CALL(transmitting);
		break;
	case SmdSat::error:
		SMD_STATE_CALL(error);
		break;
	case SmdSat::stopped:
		SMD_STATE_CALL(stopped);
		break;
	default:
		break;
	}

	if (use_scheduler && !SMD_STATE_EQUAL(stopped)) {
		system_scheduler->cancel_task(m_task);
		m_task = system_scheduler->post_task_prio([this]() {
			state_machine();
		}, "SmdReceiverStateMachine", Scheduler::DEFAULT_PRIORITY, m_next_delay);
	}
}

void SmdSat::state_starting_enter() {}
void SmdSat::state_starting_exit() {}

void SmdSat::state_starting()
{
	m_is_first_tx = true;
	is_kmac_profil_loaded = false;
	// Force Protocol A+ mode after power cycle
	m_protocol_mode = SpiProtocolMode::APLUS;
	m_protocol_detected = true;
	m_sequence_number = 0;
	m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
	m_state_counter = 3;
	m_next_delay = 0;
	SMD_STATE_CHANGE(starting, powering_on);
}

void SmdSat::state_error_enter() {
	uint8_t status = 0;
	get_kmac_status(&status);
	notify(KineisEventDeviceError({}));
	SMD_STATE_CHANGE(error, stopped);
}

