spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	// Read back raw radio config to validate what was written
	{
		uint8_t rconf_raw[SMDSAT_CMD_READ_RCONF_RAW_LEN] = {0};
		uint16_t rconf_raw_len = 0;
		try {
			read_rconf_raw(rconf_raw, &rconf_raw_len);
			char hex[SMDSAT_CMD_READ_RCONF_RAW_LEN * 2 + 1] = {0};
			for (uint16_t i = 0; i < rconf_raw_len && i < SMDSAT_CMD_READ_RCONF_RAW_LEN; i++) {
				uint8_t hi = rconf_raw[i] >> 4;
				uint8_t lo = rconf_raw[i] & 0x0F;
				hex[i * 2]     = hi < 10 ? ('0' + hi) : ('a' + hi - 10);
				hex[i * 2 + 1] = lo < 10 ? ('0' + lo) : ('a' + lo - 10);
			}
			DEBUG_INFO("SmdSat::%s: RCONF_RAW readback OK: %s", __func__, hex);
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: Failed to read back raw radio config", __func__);
		}
	}

	DEBUG_INFO("SmdSat::%s: Credentials set successfully", __func__);

cleanup:
	if (stop_spi) {
		delete m_nrf_spim;
		m_nrf_spim = nullptr;
	}
	if (was_stopped) {
		shutdown();
		GPIOPins::release_sensors_pwr();
	}
}

void SmdSat::read_credentials(unsigned int *dec_id, unsigned int *address, std::string *seckey, std::string *radioconf) {
	DEBUG_TRACE("SmdSat::%s",__func__);
	bool stop_spi = false;
	if (m_state == SmdSatState::stopped) {
		GPIOPins::acquire_sensors_pwr();
		GPIOPins::init_pin(SAT_RESET);
		GPIOPins::clear(SAT_RESET);
		GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
		GPIOPins::release_to_highz(SAT_RESET);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	}
	if (m_nrf_spim == nullptr) {
		m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
		stop_spi = true;
	}

	// Force A+ protocol mode
	m_protocol_mode = SpiProtocolMode::APLUS;
	m_protocol_detected = true;
	m_sequence_number = 0;

	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);

	if (dec_id) {
		uint32_t dec_id_val = 0;
        read_id(&dec_id_val);
		*dec_id = static_cast<unsigned int>(dec_id_val);
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
    }

    if (address) {
        uint8_t address_data[SMDSAT_CMD_READ_ADDR_LEN] = {0};
        smd_uint8_array_t address_value = {SMDSAT_CMD_READ_ADDR_LEN, address_data};
        read_address(&address_value);
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
		*address  = (address_value.p_data[0] << 24) |
					(address_value.p_data[1] << 16) |
					(address_value.p_data[2] << 8)  |
					(address_value.p_data[3]);
    }

    if (seckey) {
        uint8_t seckey_data[SMDSAT_CMD_READ_SECKEY_LEN] = {0};
        smd_uint8_array_t seckey_value = {SMDSAT_CMD_READ_SECKEY_LEN, seckey_data};
        read_seckey(&seckey_value);
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
        *seckey = Binascii::hexlify(std::string(reinterpret_cast<char *>(seckey_data), SMDSAT_CMD_READ_SECKEY_LEN));
    }

	if (radioconf) {
		uint8_t rconf_raw[SMDSAT_CMD_READ_RCONF_RAW_LEN] = {0};
		uint16_t rconf_raw_len = 0;
		read_rconf_raw(rconf_raw, &rconf_raw_len);
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
		*radioconf = Binascii::hexlify(std::string(reinterpret_cast<char *>(rconf_raw),
		                               rconf_raw_len > 0 ? rconf_raw_len : SMDSAT_CMD_READ_RCONF_RAW_LEN));
		DEBUG_INFO("SmdSat::%s: RCONF_RAW: %s", __func__, radioconf->c_str());
	}

	if(stop_spi) {
		delete m_nrf_spim;
		m_nrf_spim = nullptr;
	}
	if (m_state == SmdSatState::stopped) {
		shutdown();
		GPIOPins::release_sensors_pwr();
	}
}

// ============================================================================
// DFU (Device Firmware Update) Implementation
// ============================================================================

// CRC-32 MPEG-2 calculation (polynomial 0x04C11DB7)
// Compatible with Zephyr argos-smd-driver
uint32_t SmdSat::calculate_crc32(const uint8_t *data, size_t len) {
	return spi_crc32_mpeg2(data, len);
}

// DFU-specific send command — matches Zephyr dfu_send_cmd exactly:
// 1. Build proper A+ CMD frame
// 2. Send CMD frame (ignore RX — it's previous response)
// 3. Wait command-specific delay
// 4. Send raw 0xAA idle bytes to read response (NOT a proper A+ NOP frame!)
// 5. Re-poll with 0xAA if no valid response (0x55) in first 8 bytes
// 6. Parse response
// 7. Increment sequence number ONCE
//
// Key differences from send_command_aplus (app-mode):
// - NOP frame is raw 0xAA idle bytes, not a valid A+ frame
// - Sequence number increments only once per command
// - Response retry checks for ANY non-0x55 (not just IDLE/BUSY patterns)
SmdDfuResponse SmdSat::dfu_send_command(uint8_t cmd, const uint8_t *data, uint16_t data_len,
                                        uint8_t *response_data, uint16_t *response_len) {
	DEBUG_TRACE("SmdSat::%s: cmd=0x%02X, data_len=%u, seq=%u", __func__, cmd, data_len, m_sequence_number);

	uint8_t tx_buf[SPI_PROTOCOL_APLUS_FRAME_SIZE];
	uint8_t rx_buf[SPI_PROTOCOL_APLUS_FRAME_SIZE];

	// ═══ Step 1: Build Protocol A+ request frame ═══
	// [0xAA][SEQ][CMD][LEN][DATA...][CRC8][padding 0xAA]
	// Note: Zephyr DFU pads with DFU_IDLE_PATTERN (0xAA), not 0xFF
	uint16_t idx = 0;
	tx_buf[idx++] = SPI_PROTOCOL_APLUS_MAGIC_REQUEST;
	tx_buf[idx++] = m_sequence_number;
	tx_buf[idx++] = cmd;
	tx_buf[idx++] = static_cast<uint8_t>(data_len);
	if (data != nullptr && data_len > 0) {
		memcpy(&tx_buf[idx], data, data_len);
		idx += data_len;
	}
	tx_buf[idx] = spi_crc8_ccitt(tx_buf, idx);
	idx++;
	// Pad rest with 0xAA (matches Zephyr DFU_IDLE_PATTERN padding)
	if (idx < SPI_PROTOCOL_APLUS_FRAME_SIZE) {
		memset(&tx_buf[idx], SPI_PROTOCOL_APLUS_IDLE_PATTERN, SPI_PROTOCOL_APLUS_FRAME_SIZE - idx);
	}

	// Inter-transaction delay
	nrf_delay_ms(SMDSAT_SPI_INTER_TX_DELAY_MS);

	// ═══ Step 2: Transaction 1 — Send command (RX is old data, ignore) ═══
	memset(rx_buf, 0, sizeof(rx_buf));
	int ret = m_nrf_spim->transfer(tx_buf, rx_buf, SPI_PROTOCOL_APLUS_FRAME_SIZE);
	if (ret) {
		DEBUG_ERROR("SmdSat::%s: SPI TX failed", __func__);
		return DFU_RSP_ERROR;
	}

	DEBUG_TRACE("SmdSat::%s: RX1 (ignore): %02X %02X %02X %02X",
	            __func__, rx_buf[0], rx_buf[1], rx_buf[2], rx_buf[3]);

	// ═══ Step 3: Wait for slave to process command ═══
	uint32_t cmd_delay = get_command_delay(cmd);
	nrf_delay_ms(cmd_delay);

	// ═══ Step 4: Transaction 2 — Send raw 0xAA idle to read response ═══
	// (Zephyr DFU sends memset(tx_buf, DFU_IDLE_PATTERN, 64) — NOT a valid A+ frame!)
	memset(tx_buf, SPI_PROTOCOL_APLUS_IDLE_PATTERN, SPI_PROTOCOL_APLUS_FRAME_SIZE);
	memset(rx_buf, 0, sizeof(rx_buf));
	ret = m_nrf_spim->transfer(tx_buf, rx_buf, SPI_PROTOCOL_APLUS_FRAME_SIZE);
	if (ret) {
		DEBUG_ERROR("SmdSat::%s: SPI RX failed", __func__);
		return DFU_RSP_ERROR;
	}

