spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	DEBUG_TRACE("SmdSat::%s: RX2: %02X %02X %02X %02X %02X %02X %02X %02X",
	            __func__, rx_buf[0], rx_buf[1], rx_buf[2], rx_buf[3],
	            rx_buf[4], rx_buf[5], rx_buf[6], rx_buf[7]);

	// ═══ Step 4b: Re-poll until valid response (0x55) received ═══
	// Check first 8 bytes for response magic (matches Zephyr has_valid_response)
	constexpr uint8_t DFU_BUSY_RETRY_COUNT = 10;
	constexpr uint8_t DFU_BUSY_RETRY_DELAY_MS = 20;
	uint8_t busy_retries = 0;

	auto has_valid_response = [](const uint8_t *buf, uint8_t len) -> bool {
		uint8_t check_len = (len < 8) ? len : 8;
		for (uint8_t i = 0; i < check_len; i++) {
			if (buf[i] == SPI_PROTOCOL_APLUS_MAGIC_RESPONSE) {
				return true;
			}
		}
		return false;
	};

	while (!has_valid_response(rx_buf, SPI_PROTOCOL_APLUS_FRAME_SIZE) &&
	       busy_retries < DFU_BUSY_RETRY_COUNT) {
		DEBUG_TRACE("SmdSat::%s: No response yet (0x%02X), re-poll %u/%u",
		            __func__, rx_buf[0], busy_retries + 1, DFU_BUSY_RETRY_COUNT);

		nrf_delay_ms(DFU_BUSY_RETRY_DELAY_MS);

		// Re-poll: send idle pattern, read response
		memset(tx_buf, SPI_PROTOCOL_APLUS_IDLE_PATTERN, SPI_PROTOCOL_APLUS_FRAME_SIZE);
		memset(rx_buf, 0, sizeof(rx_buf));
		ret = m_nrf_spim->transfer(tx_buf, rx_buf, SPI_PROTOCOL_APLUS_FRAME_SIZE);
		if (ret) {
			DEBUG_ERROR("SmdSat::%s: SPI re-poll failed", __func__);
			return DFU_RSP_ERROR;
		}

		DEBUG_TRACE("SmdSat::%s: RX2 re-poll: %02X %02X %02X %02X %02X %02X %02X %02X",
		            __func__, rx_buf[0], rx_buf[1], rx_buf[2], rx_buf[3],
		            rx_buf[4], rx_buf[5], rx_buf[6], rx_buf[7]);

		busy_retries++;
	}

	if (!has_valid_response(rx_buf, SPI_PROTOCOL_APLUS_FRAME_SIZE)) {
		DEBUG_ERROR("SmdSat::%s: No valid response after %u retries", __func__, DFU_BUSY_RETRY_COUNT);
		m_sequence_number++;
		return DFU_RSP_ERROR;
	}

	// ═══ Step 5: Parse response frame ═══
	// Find 0x55 magic, parse [0x55][SEQ][STATUS][LEN][DATA...][CRC8]
	SpiAplusResponse response;
	bool parsed = parse_aplus_response(rx_buf, SPI_PROTOCOL_APLUS_FRAME_SIZE, &response);

	// Increment sequence number ONCE (matches Zephyr dfu_send_cmd)
	m_sequence_number++;

	if (!parsed) {
		DEBUG_ERROR("SmdSat::%s: Failed to parse response", __func__);
		return DFU_RSP_ERROR;
	}

	// Copy response data if requested
	if (response_data != nullptr && response_len != nullptr && response.data_len > 0) {
		uint16_t copy_len = (*response_len < response.data_len) ? *response_len : response.data_len;
		memcpy(response_data, response.data, copy_len);
		*response_len = copy_len;
	}

	// Map Protocol A+ status directly to DFU response
	// (STATUS byte 0x00=OK, 0x01=ERROR, etc. — same codes as SmdDfuResponse)
	return static_cast<SmdDfuResponse>(response.status);
}

SmdDfuResponse SmdSat::dfu_ping() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	uint8_t response_data[4];
	uint16_t response_len = sizeof(response_data);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_PING, nullptr, 0,
	                                         response_data, &response_len);

	if (result == DFU_RSP_OK && response_len >= 2) {
		DEBUG_INFO("SmdSat::%s: Bootloader v%u.%u", __func__,
		           response_data[0], response_data[1]);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_get_info(SmdDfuInfo *info) {
	DEBUG_TRACE("SmdSat::%s", __func__);

	if (info == nullptr) {
		return DFU_RSP_ERROR;
	}

	uint8_t response_data[32];
	uint16_t response_len = sizeof(response_data);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_GET_INFO, nullptr, 0,
	                                         response_data, &response_len);

	if (result == DFU_RSP_OK && response_len >= 15) {
		info->version_major = response_data[0];
		info->version_minor = response_data[1];
		info->version_patch = response_data[2];
		// Little-endian parsing (matches Zephyr argos_dfu_get_info)
		info->app_start_addr = response_data[3] | (response_data[4] << 8) |
		                       (response_data[5] << 16) | (response_data[6] << 24);
		info->app_max_size = response_data[7] | (response_data[8] << 8) |
		                     (response_data[9] << 16) | (response_data[10] << 24);
		info->flash_page_size = response_data[11] | (response_data[12] << 8) |
		                        (response_data[13] << 16) | (response_data[14] << 24);

		DEBUG_INFO("SmdSat::%s: Bootloader v%u.%u.%u, app_start=0x%08X, max_size=%u, page_size=%u",
		           __func__, info->version_major, info->version_minor, info->version_patch,
		           info->app_start_addr, info->app_max_size, info->flash_page_size);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_erase() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	// Erase takes time, use longer timeout
	PMU::kick_watchdog();
	nrf_delay_ms(100);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_ERASE, nullptr, 0, nullptr, nullptr);

	if (result == DFU_RSP_OK) {
		// Wait for erase to complete (~3 seconds for 102 pages)
		// Kick watchdog periodically during the wait
		for (unsigned int i = 0; i < SMDSAT_DFU_ERASE_TIMEOUT_MS / 500; i++) {
			PMU::kick_watchdog();
			nrf_delay_ms(500);
		}
		DEBUG_INFO("SmdSat::%s: Flash erased", __func__);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_write_chunk(uint32_t addr, const uint8_t *data, uint16_t len) {
	DEBUG_TRACE("SmdSat::%s: addr=0x%08X, len=%u", __func__, addr, len);

	if (data == nullptr || len == 0 || len > SMDSAT_DFU_CHUNK_SIZE) {
		return DFU_RSP_SIZE_ERROR;
	}

	// Step 1: Send WRITE_REQ with address and length (little-endian, matches Zephyr)
	uint8_t req_data[6];
	req_data[0] = addr & 0xFF;
	req_data[1] = (addr >> 8) & 0xFF;
	req_data[2] = (addr >> 16) & 0xFF;
	req_data[3] = (addr >> 24) & 0xFF;
	req_data[4] = len & 0xFF;
	req_data[5] = (len >> 8) & 0xFF;

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_WRITE_REQ, req_data, 6, nullptr, nullptr);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: WRITE_REQ failed", __func__);
		return result;
	}

	nrf_delay_ms(10);

	// Step 2: Send WRITE_DATA with actual data
	result = dfu_send_command(SMDSAT_CMD_DFU_WRITE_DATA, data, len, nullptr, nullptr);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: WRITE_DATA failed at addr 0x%08X", __func__, addr);
	}

	return result;
}

