spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
SmdDfuResponse SmdSat::dfu_read_chunk(uint32_t addr, uint8_t *data, uint16_t len) {
	DEBUG_TRACE("SmdSat::%s: addr=0x%08X, len=%u", __func__, addr, len);

	if (data == nullptr || len == 0) {
		return DFU_RSP_SIZE_ERROR;
	}

	// Step 1: Send READ_REQ with address and length (little-endian, matches Zephyr)
	uint8_t req_data[6];
	req_data[0] = addr & 0xFF;
	req_data[1] = (addr >> 8) & 0xFF;
	req_data[2] = (addr >> 16) & 0xFF;
	req_data[3] = (addr >> 24) & 0xFF;
	req_data[4] = len & 0xFF;
	req_data[5] = (len >> 8) & 0xFF;

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_READ_REQ, req_data, 6, nullptr, nullptr);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: READ_REQ failed", __func__);
		return result;
	}

	nrf_delay_ms(10);

	// Step 2: Read data
	uint16_t response_len = len;
	result = dfu_send_command(SMDSAT_CMD_DFU_READ_DATA, nullptr, 0, data, &response_len);

	return result;
}

SmdDfuResponse SmdSat::dfu_verify(uint32_t crc32) {
	DEBUG_TRACE("SmdSat::%s: crc32=0x%08X", __func__, crc32);

	// Send CRC32 in little-endian format (matches Zephyr argos_dfu_verify)
	uint8_t crc_data[4];
	crc_data[0] = crc32 & 0xFF;
	crc_data[1] = (crc32 >> 8) & 0xFF;
	crc_data[2] = (crc32 >> 16) & 0xFF;
	crc_data[3] = (crc32 >> 24) & 0xFF;

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_VERIFY, crc_data, 4, nullptr, nullptr);

	if (result == DFU_RSP_OK) {
		DEBUG_INFO("SmdSat::%s: CRC verification passed", __func__);
	} else {
		DEBUG_ERROR("SmdSat::%s: CRC verification failed", __func__);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_reset() {
	DEBUG_TRACE("SmdSat::%s", __func__);
	return dfu_send_command(SMDSAT_CMD_DFU_RESET, nullptr, 0, nullptr, nullptr);
}

SmdDfuResponse SmdSat::dfu_jump() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_JUMP, nullptr, 0, nullptr, nullptr);

	if (result == DFU_RSP_OK) {
		m_dfu_mode = false;
		DEBUG_INFO("SmdSat::%s: Jumping to application", __func__);
		nrf_delay_ms(SMDSAT_DFU_RESET_DELAY_MS);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_get_status(uint8_t *status) {
	DEBUG_TRACE("SmdSat::%s", __func__);

	uint8_t response_data[4];
	uint16_t response_len = sizeof(response_data);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_GET_STATUS, nullptr, 0,
	                                         response_data, &response_len);

	if (result == DFU_RSP_OK && status != nullptr && response_len >= 1) {
		*status = response_data[0];
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_abort() {
	DEBUG_TRACE("SmdSat::%s", __func__);
	return dfu_send_command(SMDSAT_CMD_DFU_ABORT, nullptr, 0, nullptr, nullptr);
}

SmdDfuResponse SmdSat::dfu_set_header(const uint8_t *header) {
	DEBUG_TRACE("SmdSat::%s", __func__);

	if (header == nullptr) {
		return DFU_RSP_ERROR;
	}

	return dfu_send_command(SMDSAT_CMD_DFU_SET_HEADER, header, SMDSAT_DFU_HEADER_SIZE, nullptr, nullptr);
}

// Reproduces exact Zephyr spi_dfu_test flow:
// STEP 1: SYNC (5x 0xFF frames, wait for 0xAA idle)
// STEP 2: PING APP (cmd 0x02, standard A+ protocol)
// STEP 3: DFU_ENTER (cmd 0x3F, send-only)
// STEP 4: WAIT 2s FOR STM32 RESET
// STEP 5: SYNC WITH BOOTLOADER (5x 0xFF frames)
// STEP 6: PING BOOTLOADER (cmd 0x30, DFU protocol)
bool SmdSat::dfu_enter() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);
	bool stop_spi = false;

	if (was_stopped) {
		// Power on SMD WITHOUT asserting hardware reset.
		// DFU_ENTER (0x3F) is a software command to the running app —
		// the STM32 will software-reset into bootloader itself.
		// Just power on and let the STM32 internal POR handle clean boot.
		GPIOPins::acquire_sensors_pwr();
		GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif
		// SAT_RESET left disconnected (high-Z) — STM32 internal pull-up keeps it HIGH
		PMU::kick_watchdog();
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
		PMU::kick_watchdog();
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	}

	if (m_nrf_spim == nullptr) {
		m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
		stop_spi = true;
	}

	// Force A+ protocol mode
	m_protocol_mode = SpiProtocolMode::APLUS;
	m_protocol_detected = true;
	m_sequence_number = 0;

	// Wait for SMD application to be ready
	PMU::kick_watchdog();
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);

	// ═══ STEP 1: SYNC with APP (matches Zephyr spi_dfu_test STEP 1) ═══
	// Send 5 dummy 0xFF frames, check for 0xAA idle response
	DEBUG_INFO("SmdSat::%s: STEP 1 - SPI sync with app...", __func__);
	{
		uint8_t sync_tx[SPI_PROTOCOL_APLUS_FRAME_SIZE];
		uint8_t sync_rx[SPI_PROTOCOL_APLUS_FRAME_SIZE];
		memset(sync_tx, 0xFF, sizeof(sync_tx));

		m_sequence_number = 0;
		for (int i = 0; i < 5; i++) {
			PMU::kick_watchdog();
			memset(sync_rx, 0, sizeof(sync_rx));
			m_nrf_spim->transfer(sync_tx, sync_rx, SPI_PROTOCOL_APLUS_FRAME_SIZE);
			nrf_delay_ms(SMDSAT_SPI_DETECT_TIMEOUT_MS);

			DEBUG_TRACE("SmdSat::%s: Sync %d RX: %02X %02X %02X %02X %02X %02X %02X %02X",
			            __func__, i, sync_rx[0], sync_rx[1], sync_rx[2], sync_rx[3],
			            sync_rx[4], sync_rx[5], sync_rx[6], sync_rx[7]);
		}
	}
	PMU::kick_watchdog();
	nrf_delay_ms(100);

	// ═══ STEP 2: PING APP (matches Zephyr spi_dfu_test STEP 2) ═══
	// Use standard A+ protocol (send_command_aplus) with cmd 0x02
	DEBUG_INFO("SmdSat::%s: STEP 2 - Ping app (cmd 0x02)...", __func__);
	m_sequence_number = 0;
	{
		SpiAplusResponse app_response;
		bool app_ok = send_command_aplus(SMDSAT_CMD_PING, nullptr, 0, &app_response);
		if (app_ok && app_response.status == SPI_APLUS_STATUS_OK) {
			DEBUG_INFO("SmdSat::%s: APP PING OK!", __func__);
		} else {
			DEBUG_WARN("SmdSat::%s: APP PING failed, checking if already in bootloader...", __func__);
			// Try DFU ping - maybe already in bootloader mode
			m_sequence_number = 0;
			SmdDfuResponse bl_ping = dfu_ping();
			if (bl_ping == DFU_RSP_OK) {
				DEBUG_INFO("SmdSat::%s: Already in BOOTLOADER mode!", __func__);
				m_dfu_mode = true;
				return true;
			}
			DEBUG_WARN("SmdSat::%s: No response from app or bootloader, trying DFU_ENTER anyway...", __func__);
		}
	}
	PMU::kick_watchdog();
	nrf_delay_ms(200);

	// ═══ STEP 3: DFU_ENTER (matches Zephyr spi_dfu_test STEP 3) ═══
	// Send CMD 0x3F as send-only (STM32 resets immediately, can't respond)
	DEBUG_INFO("SmdSat::%s: STEP 3 - DFU_ENTER (cmd 0x3F, send-only)...", __func__);
	{
		uint8_t tx_buf[SPI_PROTOCOL_APLUS_FRAME_SIZE];
		uint8_t rx_buf[SPI_PROTOCOL_APLUS_FRAME_SIZE];

		build_aplus_frame(tx_buf, SMDSAT_CMD_DFU_ENTER, nullptr, 0);
		memset(rx_buf, 0, sizeof(rx_buf));
		m_nrf_spim->transfer(tx_buf, rx_buf, SPI_PROTOCOL_APLUS_FRAME_SIZE);
		m_sequence_number++;
	}

	// Reset DFU sequence number (matches Zephyr data->dfu_seq_num = 0)
	m_sequence_number = 0;

