spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	// ═══ STEP 4: DIAGNOSTIC — check if STM32 entered bootloader or stayed in APP ═══
	// Wait 2s for STM32 to reset, then try BOTH app ping and DFU ping
	DEBUG_INFO("SmdSat::%s: STEP 4 - Wait 2s then diagnose...", __func__);
	for (int i = 0; i < 4; i++) {
		PMU::kick_watchdog();
		nrf_delay_ms(500);
	}

	// 4a: Try APP PING (0x02) — if this works, DFU_ENTER didn't take effect
	DEBUG_INFO("SmdSat::%s: 4a - Try APP PING (0x02) to check if app still running...", __func__);
	m_sequence_number = 0;
	{
		SpiAplusResponse app_response;
		bool app_ok = send_command_aplus(SMDSAT_CMD_PING, nullptr, 0, &app_response);
		if (app_ok && app_response.status == SPI_APLUS_STATUS_OK) {
			DEBUG_WARN("SmdSat::%s: 4a APP STILL RUNNING! DFU_ENTER (0x3F) did NOT reset to bootloader!", __func__);
		} else {
			DEBUG_INFO("SmdSat::%s: 4a APP not responding (expected if in bootloader)", __func__);
		}
	}
	PMU::kick_watchdog();

	// 4b: Try DFU PING (0x30)
	DEBUG_INFO("SmdSat::%s: 4b - Try DFU PING (0x30)...", __func__);
	m_sequence_number = 0;
	{
		SmdDfuResponse bl_ping = dfu_ping();
		if (bl_ping == DFU_RSP_OK) {
			DEBUG_INFO("SmdSat::%s: 4b BOOTLOADER PING OK!", __func__);
			m_dfu_mode = true;
			return true;
		}
		DEBUG_INFO("SmdSat::%s: 4b DFU ping failed", __func__);
	}
	PMU::kick_watchdog();

	// 4c: Raw SPI — send idle frames and log what MISO returns
	DEBUG_INFO("SmdSat::%s: 4c - Raw SPI idle frames...", __func__);
	{
		uint8_t tx_buf[SPI_PROTOCOL_APLUS_FRAME_SIZE];
		uint8_t rx_buf[SPI_PROTOCOL_APLUS_FRAME_SIZE];
		memset(tx_buf, 0xFF, sizeof(tx_buf));
		for (int i = 0; i < 3; i++) {
			memset(rx_buf, 0, sizeof(rx_buf));
			m_nrf_spim->transfer(tx_buf, rx_buf, SPI_PROTOCOL_APLUS_FRAME_SIZE);
			DEBUG_INFO("SmdSat::%s: 4c raw %d RX: %02X %02X %02X %02X %02X %02X %02X %02X",
			           __func__, i, rx_buf[0], rx_buf[1], rx_buf[2], rx_buf[3],
			           rx_buf[4], rx_buf[5], rx_buf[6], rx_buf[7]);
			nrf_delay_ms(30);
		}
	}
	PMU::kick_watchdog();

	// 4d: Wait more and try again (total ~7s since DFU_ENTER)
	DEBUG_INFO("SmdSat::%s: 4d - Wait 3s more, then retry both pings...", __func__);
	for (int i = 0; i < 6; i++) {
		PMU::kick_watchdog();
		nrf_delay_ms(500);
	}

	// 4e: Retry APP PING
	m_sequence_number = 0;
	{
		SpiAplusResponse app_response;
		bool app_ok = send_command_aplus(SMDSAT_CMD_PING, nullptr, 0, &app_response);
		if (app_ok && app_response.status == SPI_APLUS_STATUS_OK) {
			DEBUG_WARN("SmdSat::%s: 4e APP PING OK after 7s — app restarted, DFU_ENTER not working!", __func__);
		} else {
			DEBUG_INFO("SmdSat::%s: 4e APP still not responding", __func__);
		}
	}

	// 4f: Retry DFU PING
	m_sequence_number = 0;
	{
		SmdDfuResponse bl_ping = dfu_ping();
		if (bl_ping == DFU_RSP_OK) {
			DEBUG_INFO("SmdSat::%s: 4f BOOTLOADER PING OK after 7s!", __func__);
			m_dfu_mode = true;
			return true;
		}
		DEBUG_INFO("SmdSat::%s: 4f DFU ping still failing", __func__);
	}

	DEBUG_ERROR("SmdSat::%s: Neither APP nor BOOTLOADER responding after DFU_ENTER", __func__);

	// Cleanup on failure
	if (stop_spi) {
		delete m_nrf_spim;
		m_nrf_spim = nullptr;
	}
	if (was_stopped) {
		shutdown();
		GPIOPins::release_sensors_pwr();
	}

	return false;
}

bool SmdSat::dfu_exit() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	if (!m_dfu_mode) {
		DEBUG_WARN("SmdSat::%s: Not in DFU mode", __func__);
		return true;  // Already in application mode
	}

	SmdDfuResponse result = dfu_jump();
	if (result == DFU_RSP_OK) {
		m_dfu_mode = false;
		return true;
	}

	return false;
}

bool SmdSat::dfu_get_bootloader_info(SmdDfuInfo *info) {
	if (!m_dfu_mode) {
		DEBUG_WARN("SmdSat::%s: Not in DFU mode", __func__);
		return false;
	}

	return (dfu_get_info(info) == DFU_RSP_OK);
}

SmdDfuResponse SmdSat::firmware_update(const uint8_t *firmware, size_t size,
                                       void (*progress_callback)(uint8_t percent)) {
	DEBUG_INFO("SmdSat::%s: Starting firmware update, size=%u bytes", __func__, (unsigned int)size);

	if (firmware == nullptr || size == 0) {
		DEBUG_ERROR("SmdSat::%s: Invalid firmware data", __func__);
		return DFU_RSP_ERROR;
	}

	SmdDfuResponse result;

	// Step 1: Enter DFU mode if not already
	if (!m_dfu_mode) {
		DEBUG_INFO("SmdSat::%s: Entering DFU mode...", __func__);
		if (!dfu_enter()) {
			DEBUG_ERROR("SmdSat::%s: Failed to enter DFU mode", __func__);
			return DFU_RSP_NOT_READY;
		}
	}

	if (progress_callback) progress_callback(5);

	// Step 2: Ping bootloader
	DEBUG_INFO("SmdSat::%s: Pinging bootloader...", __func__);
	result = dfu_ping();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Bootloader not responding", __func__);
		return result;
	}

	if (progress_callback) progress_callback(10);

	// Step 3: Get bootloader info
	DEBUG_INFO("SmdSat::%s: Getting bootloader info...", __func__);
	result = dfu_get_info(&m_dfu_info);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Failed to get bootloader info", __func__);
		return result;
	}

	// Validate firmware size
	if (size > m_dfu_info.app_max_size) {
		DEBUG_ERROR("SmdSat::%s: Firmware too large (%u > %u)", __func__,
		            (unsigned int)size, m_dfu_info.app_max_size);
		return DFU_RSP_SIZE_ERROR;
	}

	if (progress_callback) progress_callback(15);

	// Step 4: Erase application area
	DEBUG_INFO("SmdSat::%s: Erasing flash...", __func__);
	result = dfu_erase();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Flash erase failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(25);

	// Step 5: Write firmware in chunks
	DEBUG_INFO("SmdSat::%s: Writing firmware...", __func__);
	uint32_t addr = m_dfu_info.app_start_addr;
	size_t remaining = size;
	size_t offset = 0;
	uint8_t last_progress = 25;

	while (remaining > 0) {
		uint16_t chunk_size = (remaining > SMDSAT_DFU_CHUNK_SIZE) ?
		                      SMDSAT_DFU_CHUNK_SIZE : (uint16_t)remaining;

		result = dfu_write_chunk(addr, &firmware[offset], chunk_size);
		if (result != DFU_RSP_OK) {
			DEBUG_ERROR("SmdSat::%s: Write failed at offset %u", __func__, (unsigned int)offset);
			dfu_abort();
			return result;
		}

		addr += chunk_size;
		offset += chunk_size;
		remaining -= chunk_size;

		// Update progress (25% to 85% for write phase)
		if (progress_callback) {
			uint8_t progress = 25 + (uint8_t)((offset * 60) / size);
			if (progress > last_progress) {
				progress_callback(progress);
				last_progress = progress;
			}
		}

