spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
		// Small delay between chunks
		nrf_delay_ms(5);
	}

	DEBUG_INFO("SmdSat::%s: Firmware written successfully", __func__);

	if (progress_callback) progress_callback(90);

	// Step 6: Verify CRC32
	DEBUG_INFO("SmdSat::%s: Verifying firmware CRC...", __func__);
	uint32_t crc = calculate_crc32(firmware, size);
	result = dfu_verify(crc);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: CRC verification failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(95);

	// Step 7: Jump to application
	DEBUG_INFO("SmdSat::%s: Jumping to application...", __func__);
	result = dfu_jump();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Jump to application failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(100);

	DEBUG_INFO("SmdSat::%s: Firmware update completed successfully!", __func__);
	return DFU_RSP_OK;
}

SmdDfuResponse SmdSat::firmware_update(File *file, size_t size, uint32_t stm32_crc32,
                                       void (*progress_callback)(uint8_t percent)) {
	DEBUG_INFO("SmdSat::%s: Starting streamed firmware update, size=%u bytes, CRC32=0x%08X",
	           __func__, (unsigned int)size, stm32_crc32);

	if (file == nullptr || size == 0) {
		DEBUG_ERROR("SmdSat::%s: Invalid file or size", __func__);
		return DFU_RSP_ERROR;
	}

	SmdDfuResponse result;

	// Step 1: Enter DFU mode if not already
	if (!m_dfu_mode) {
		DEBUG_INFO("SmdSat::%s: Entering DFU mode...", __func__);
		if (!dfu_enter()) {
			DEBUG_ERROR("SmdSat::%s: Failed to enter DFU mode", __func__);
			return DFU_RSP_NOT_READY;
		}
	}

	if (progress_callback) progress_callback(5);

	// Step 2: Ping bootloader
	PMU::kick_watchdog();
	DEBUG_INFO("SmdSat::%s: Pinging bootloader...", __func__);
	result = dfu_ping();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Bootloader not responding", __func__);
		return result;
	}

	if (progress_callback) progress_callback(10);

	// Step 3: Get bootloader info
	PMU::kick_watchdog();
	DEBUG_INFO("SmdSat::%s: Getting bootloader info...", __func__);
	result = dfu_get_info(&m_dfu_info);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Failed to get bootloader info", __func__);
		return result;
	}

	// Validate firmware size
	if (size > m_dfu_info.app_max_size) {
		DEBUG_ERROR("SmdSat::%s: Firmware too large (%u > %u)", __func__,
		            (unsigned int)size, m_dfu_info.app_max_size);
		return DFU_RSP_SIZE_ERROR;
	}

	if (progress_callback) progress_callback(15);

	// Step 4: Erase application area (3+ seconds — dfu_erase kicks watchdog internally)
	DEBUG_INFO("SmdSat::%s: Erasing flash...", __func__);
	result = dfu_erase();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Flash erase failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(25);

	// Step 5: Write firmware in chunks — streamed from file (no large heap allocation)
	DEBUG_INFO("SmdSat::%s: Writing firmware (streamed)...", __func__);
	uint32_t addr = m_dfu_info.app_start_addr;
	size_t remaining = size;
	size_t offset = 0;
	uint8_t last_progress = 25;
	uint8_t chunk_buf[SMDSAT_DFU_CHUNK_SIZE];

	while (remaining > 0) {
		uint16_t chunk_size = (remaining > SMDSAT_DFU_CHUNK_SIZE) ?
		                      SMDSAT_DFU_CHUNK_SIZE : (uint16_t)remaining;

		PMU::kick_watchdog();

		lfs_ssize_t bytes_read = file->read(chunk_buf, chunk_size);
		if (bytes_read != (lfs_ssize_t)chunk_size) {
			DEBUG_ERROR("SmdSat::%s: File read failed at offset %u (got %d, expected %u)",
			            __func__, (unsigned int)offset, (int)bytes_read, chunk_size);
			dfu_abort();
			return DFU_RSP_ERROR;
		}

		result = dfu_write_chunk(addr, chunk_buf, chunk_size);
		if (result != DFU_RSP_OK) {
			DEBUG_ERROR("SmdSat::%s: Write failed at offset %u", __func__, (unsigned int)offset);
			dfu_abort();
			return result;
		}

		addr += chunk_size;
		offset += chunk_size;
		remaining -= chunk_size;

		// Update progress (25% to 85% for write phase)
		if (progress_callback) {
			uint8_t progress = 25 + (uint8_t)((offset * 60) / size);
			if (progress > last_progress) {
				progress_callback(progress);
				last_progress = progress;
			}
		}

		// Small delay between chunks
		nrf_delay_ms(5);
	}

	DEBUG_INFO("SmdSat::%s: Firmware written successfully", __func__);

	if (progress_callback) progress_callback(90);

	// Step 6: Verify CRC32 — use pre-computed CRC from firmware header
	DEBUG_INFO("SmdSat::%s: Verifying firmware CRC (0x%08X)...", __func__, stm32_crc32);
	result = dfu_verify(stm32_crc32);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: CRC verification failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(95);

	// Step 7: Jump to application
	DEBUG_INFO("SmdSat::%s: Jumping to application...", __func__);
	result = dfu_jump();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Jump to application failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(100);

	DEBUG_INFO("SmdSat::%s: Streamed firmware update completed successfully!", __func__);
	return DFU_RSP_OK;
}

SmdDfuResponse SmdSat::firmware_update_from_file(const std::string& filepath,
                                                 void (*progress_callback)(uint8_t percent)) {
	DEBUG_INFO("SmdSat::%s: Loading firmware from %s", __func__, filepath.c_str());

	// Note: File reading requires filesystem support
	// This is a placeholder - actual implementation depends on platform filesystem

	(void)filepath;
	(void)progress_callback;

	DEBUG_ERROR("SmdSat::%s: File-based update not implemented - use firmware_update() with data buffer", __func__);
	return DFU_RSP_ERROR;
}

std::string SmdSat::get_firmware_version() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);
	bool need_spi_cleanup = false;

	// Initialize SPI BEFORE power-on (same as state_starting)
	// SPI pins must be configured before powering SMD to avoid floating pins issues
	if (m_nrf_spim == nullptr) {
		m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
		need_spi_cleanup = true;
	}

	// Power on SMD if needed (same sequence as state_powering_on)
	if (was_stopped) {
		DEBUG_INFO("SmdSat::%s: Powering on SMD to read version", __func__);
		GPIOPins::acquire_sensors_pwr();
		GPIOPins::init_pin(SAT_RESET);
		GPIOPins::clear(SAT_RESET);
		nrf_delay_ms(10);
		GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
		GPIOPins::release_to_highz(SAT_RESET);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	}

	std::string version = "";

	// Force Protocol A+ mode for ping
	m_protocol_detected = true;
	m_protocol_mode = SpiProtocolMode::APLUS;
	m_sequence_number = 0;

