spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	try {
		// Ping via A+ to confirm SMD is ready
		bool smd_ready = false;
		for (uint8_t attempt = 0; attempt < 10; attempt++) {
			nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);
			if (smd_ping()) {
				DEBUG_INFO("SmdSat::%s: SMD ready after %u attempts", __func__, attempt + 1);
				smd_ready = true;
				break;
			}
		}

		if (!smd_ready) {
			DEBUG_ERROR("SmdSat::%s: SMD not ready, cannot read firmware version", __func__);
		} else {
			// CMD_READ_VERSION (0x05) via A+ - returns firmware version string
			// (CMD_READ_FIRMWARE 0x06 is NOT supported in A+ by STM32 firmware)
			uint8_t rx[SPI_PROTOCOL_APLUS_MAX_DATA_LEN] = {0};
			uint16_t rx_len = sizeof(rx);

			if (send_command_auto(SMDSAT_CMD_READ_VERSION, nullptr, 0, rx, &rx_len)) {
				size_t len = 0;
				while (len < rx_len && rx[len] != 0 &&
				       rx[len] >= 0x20 && rx[len] < 0x7F) {
					len++;
				}
				version = std::string((char*)rx, len);
				DEBUG_INFO("SmdSat::%s: Firmware version: %s (len=%zu)", __func__, version.c_str(), len);
			} else {
				DEBUG_ERROR("SmdSat::%s: CMD_READ_VERSION failed", __func__);
			}
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: Failed to read firmware version", __func__);
	}

	// Cleanup if we initialized SPI
	if (need_spi_cleanup) {
		delete m_nrf_spim;
		m_nrf_spim = nullptr;
	}

	// Full power off SMD if we powered it on
	if (was_stopped) {
		shutdown();
		GPIOPins::release_sensors_pwr();
	}

	return version;
}

std::string SmdSat::smd_spi_test() {
	DEBUG_INFO("SmdSat::%s: === SMD SPI COMMAND TEST START ===", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);
	bool need_spi_cleanup = false;
	std::string result;

	// Initialize SPI if needed
	if (m_nrf_spim == nullptr) {
		m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
		need_spi_cleanup = true;
	}

	// Power on SMD if needed
	if (was_stopped) {
		DEBUG_INFO("SmdSat::%s: Powering on SMD for test", __func__);
		GPIOPins::acquire_sensors_pwr();
		GPIOPins::init_pin(SAT_RESET);
		GPIOPins::clear(SAT_RESET);
		nrf_delay_ms(10);
		GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
		GPIOPins::release_to_highz(SAT_RESET);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	}

	// Force A+ protocol
	m_protocol_detected = true;
	m_protocol_mode = SpiProtocolMode::APLUS;
	m_sequence_number = 0;

	// Helper: test a read command and log raw bytes
	struct CmdTest {
		uint8_t cmd;
		const char *name;
		uint16_t expected_len;  // 0 = no data expected (status-only)
	};

	CmdTest tests[] = {
		{ SMDSAT_CMD_PING,             "PING",             0 },
		{ SMDSAT_CMD_READ_VERSION,     "READ_VERSION",     1 },
		{ SMDSAT_CMD_READ_FIRMWARE,    "READ_FIRMWARE",    SMDSAT_CMD_READ_FIRMWARE_LEN },
		{ SMDSAT_CMD_SPI_STATUS,       "SPI_STATUS",       1 },
		{ SMDSAT_CMD_MAC_STATUS,       "MAC_STATUS",       1 },
		{ SMDSAT_CMD_READ_ID,          "READ_ID",          SMDSAT_CMD_READ_ID_LEN },
		{ SMDSAT_CMD_READ_ADDR,        "READ_ADDR",        SMDSAT_CMD_READ_ADDR_LEN },
		{ SMDSAT_CMD_READ_SN,          "READ_SN",          SMDSAT_CMD_READ_SERIAL_LEN },
		{ SMDSAT_CMD_READ_RCONF,       "READ_RCONF",       SMDSAT_CMD_READCONF_LEN },
		{ SMDSAT_CMD_READ_KMAC,        "READ_KMAC",        SMDSAT_CMD_READ_KMAC_LEN },
		{ SMDSAT_CMD_READ_LPM,         "READ_LPM",         1 },
		{ SMDSAT_CMD_READ_SECKEY,      "READ_SECKEY",      SMDSAT_CMD_READ_SECKEY_LEN },
		{ SMDSAT_CMD_READ_CW,          "READ_CW",          1 },
		{ SMDSAT_CMD_READ_PREPASSEN,   "READ_PREPASSEN",   1 },
		{ SMDSAT_CMD_READ_UDATE,       "READ_UDATE",       1 },
		{ SMDSAT_CMD_READ_TCXO,        "READ_TCXO",        4 },
		{ SMDSAT_CMD_READ_SPIMAC_STATE,"READ_SPIMAC_STATE",SMDSAT_CMD_READ_SPIMAC_STATE_LEN },
		{ SMDSAT_CMD_READ_RCONF_RAW,   "READ_RCONF_RAW",   SMDSAT_CMD_READ_RCONF_RAW_LEN },
	};

	uint8_t pass_count = 0;
	uint8_t fail_count = 0;
	uint8_t num_tests = sizeof(tests) / sizeof(tests[0]);

	try {
		// Wait for SMD to become ready with ping
		bool smd_ready = false;
		for (uint8_t attempt = 0; attempt < 10; attempt++) {
			nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);
			if (smd_ping()) {
				DEBUG_INFO("SmdSat::%s: SMD ready after %u attempts", __func__, attempt + 1);
				smd_ready = true;
				break;
			}
		}

		if (!smd_ready) {
			DEBUG_ERROR("SmdSat::%s: SMD not ready - aborting test", __func__);
			result = "FAIL: SMD not ready (ping failed)";
		} else {
			std::string fails;

			for (uint8_t i = 0; i < num_tests; i++) {
				SpiAplusResponse response = {};

				DEBUG_INFO("--- Test %u/%u: CMD 0x%02X (%s) ---",
				           i + 1, num_tests, tests[i].cmd, tests[i].name);

				bool ok = false;
				try {
					ok = send_command_aplus(tests[i].cmd, nullptr, 0, &response);
				} catch (...) {
					DEBUG_ERROR("  EXCEPTION during transfer");
				}

				if (ok && response.status == SPI_APLUS_STATUS_OK) {
					pass_count++;
					DEBUG_INFO("  PASS: status=%u len=%u", (unsigned)response.status, response.data_len);

					// Log raw data (up to 32 bytes)
					uint16_t print_len = response.data_len;
					if (print_len > 32) print_len = 32;
					if (print_len > 0) {
						char hex[97] = {0};  // 32*3 + 1
						for (uint16_t j = 0; j < print_len; j++) {
							uint8_t hi = response.data[j] >> 4;
							uint8_t lo = response.data[j] & 0x0F;
							hex[j * 3]     = hi < 10 ? ('0' + hi) : ('A' + hi - 10);
							hex[j * 3 + 1] = lo < 10 ? ('0' + lo) : ('A' + lo - 10);
							hex[j * 3 + 2] = ' ';
						}
						hex[print_len * 3] = 0;
						DEBUG_INFO("  DATA[%u]: %s", response.data_len, hex);
					}

					// For string-type commands, try to print as string
					if (tests[i].cmd == SMDSAT_CMD_READ_VERSION ||
					    tests[i].cmd == SMDSAT_CMD_READ_FIRMWARE ||
					    tests[i].cmd == SMDSAT_CMD_READ_SN) {
						size_t slen = 0;
						while (slen < response.data_len && response.data[slen] != 0 &&
						       response.data[slen] >= 0x20 && response.data[slen] < 0x7F) {
							slen++;
						}
						if (slen > 0) {
							DEBUG_INFO("  STR: \"%.*s\"", (int)slen, (char*)response.data);
						}
					}
				} else {
					fail_count++;
					DEBUG_ERROR("  FAIL: ok=%d status=%u len=%u",
					            ok, (unsigned)response.status, response.data_len);
					if (!fails.empty()) fails += " ";
					fails += tests[i].name;
				}

				// Small delay between commands
				nrf_delay_ms(50);
			}

			DEBUG_INFO("=== TEST SUMMARY: %u/%u PASSED, %u FAILED ===",
			           pass_count, num_tests, fail_count);

			// Compact DTE result: "13/14 OK" or "13/14 FAIL:READ_FIRMWARE"
			result = std::to_string(pass_count) + "/" + std::to_string(num_tests);
			if (fail_count == 0) {
				result += " ALL OK";
			} else {
				result += " FAIL:" + fails;
			}
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: Exception during test", __func__);
		result = "FAIL: Exception";
	}

	// Cleanup
	if (need_spi_cleanup) {
		delete m_nrf_spim;
		m_nrf_spim = nullptr;
	}
	if (was_stopped) {
		shutdown();
		GPIOPins::release_sensors_pwr();
	}

	DEBUG_INFO("SmdSat::%s: === SMD SPI COMMAND TEST END ===", __func__);
	return result;
}
